# 데이터프레임 생성

- 동일한 길이의 1차원 배열 여러 개가 필요

In [1]:
import pandas as pd

In [3]:
dict_data = {"c0" : [1,2,3],
             "c1" : [4,5,6],
             "c2" : [7,8,9]}

In [4]:
# 딕셔너리를 데이터프레임으로 변환
df = pd.DataFrame(dict_data)

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df

   c0  c1  c2
0   1   4   7
1   2   5   8
2   3   6   9

# 행 인덱스/열 이름 설정

In [9]:
df = pd.DataFrame([[2000, "페퍼로니피자"],
                  [4000, "불족발"]],
                 index = ["A피자", "B족발"],
                 columns = ["가격", "대표메뉴"])

In [10]:
df

       가격    대표메뉴
A피자  2000  페퍼로니피자
B족발  4000     불족발

In [12]:
# 행 인덱스
df.index

Index(['A피자', 'B족발'], dtype='object')

In [13]:
# 열 이름
df.columns

Index(['가격', '대표메뉴'], dtype='object')

# 행 인덱스/열 이름 변경

In [14]:
# 행 인덱스 변경
df.index = ["피자집","족발집"]

In [15]:
df

       가격    대표메뉴
피자집  2000  페퍼로니피자
족발집  4000     불족발

In [16]:
# 열 이름 변경
df.columns = ["price", "menu"]

In [17]:
df

     price    menu
피자집   2000  페퍼로니피자
족발집   4000     불족발

# 행 인덱스/열 이름 변경(rename 메서드 활용)

In [22]:
df.rename(columns = {"price" : "가격", "menu" : "대표메뉴"})

       가격    대표메뉴
피자집  2000  페퍼로니피자
족발집  4000     불족발

In [24]:
# rename 메서드 실행만으로 원본 객체가 수정되지 않음
df

     price    menu
피자집   2000  페퍼로니피자
족발집   4000     불족발

In [25]:
# 원본 객체를 수정하려면 inplace = True 옵션을 사용
df.rename(columns = {"price" : "가격", "menu" : "대표메뉴"}, inplace = True)

In [26]:
df

       가격    대표메뉴
피자집  2000  페퍼로니피자
족발집  4000     불족발

# 행/열 삭제
- drop( ) 메서드
  - axis = 0
    - 행 삭제

  - axis = 1
    - 열 삭제
   
  - 동시에 여러 행 또는 열 삭제
    - 리스트 형태로 입력
   
  - 기존 객체를 변경하지 않고 새로운 객체를 반환
    - 원본 객체를 직접 변경하기 위해서는 inplace = True 옵션 사용

In [27]:
exam_data = {"국어" : [27, 91, 74],
             "영어" : [69, 12, 80],
             "수학" : [73, 24, 17],
             "과학" : [72, 61, 38]}
df = pd.DataFrame(exam_data, index = ["학생1", "학생2", "학생3"])

In [28]:
df

     국어  영어  수학  과학
학생1  27  69  73  72
학생2  91  12  24  61
학생3  74  80  17  38

In [29]:
df2 = df.copy()

In [31]:
id(df2), id(df)

(4689715792, 4873643664)

# 행 삭제

In [33]:
df2.drop("학생2", axis = 0, inplace = True)

In [34]:
df2

     국어  영어  수학  과학
학생1  27  69  73  72
학생3  74  80  17  38

In [36]:
df3 = df[:]

In [37]:
id(df3), id(df)

(4873084752, 4873643664)

In [43]:
df3

     국어  영어  수학  과학
학생1  27  69  73  72

In [45]:
df

     국어  영어  수학  과학
학생1  27  69  73  72
학생2  91  12  24  61
학생3  74  80  17  38

# 열 삭제

In [46]:
df4 = df.copy()

In [48]:
df4.drop("국어", axis = 1, inplace = True)

In [49]:
df4

     영어  수학  과학
학생1  69  73  72
학생2  12  24  61
학생3  80  17  38

In [50]:
df5 = df.copy()

In [51]:
df5.drop(["영어", "수학"], axis = 1, inplace = True)

In [52]:
df5

     국어  과학
학생1  27  72
학생2  91  61
학생3  74  38